# 홑 따옴표, 쌍 따옴표
print('Hello Python') # Hello Python
print("Hello Python") # Hello Python

# 정수 및 실수 출력
print(10) # 10
print(11, 12) # 11 12

# 사칙연산 결과 출력
print(10 + 11) # 21
print(12 - 13) # -1
print(4 * 5) # 20
print(6 / 3) # 2
print(10 + 11, 12 - 13) # 21 -1
print(4 * 5, 6 / 3) # 20 2

# 문자열과 정수, 실수 출력
print('10 + 11 =', 10 + 11) # 10 + 11 = 21
print('12 / 6 =', 12 / 6) # 12 / 6 = 2

# sep(separation)
print('010', '1234', '5678', sep='-') # 010-1234-5678
print('나이', 30, sep=':') # 나이:30

# end
print(10, end='%') # 10%
print(30, end='$') # 30$

# Escape 문자
# \n
print('다음 줄에 이어서\n출력')
'''
다음 줄에 이어서
출력
'''
print(1, 2, 3, 4, sep='\n')
'''
1
2
3
4
'''

#\r
print('다음 줄에 이어서\r출력') # 출력
print(1, 2, 3, 4, sep='\r') # 4

# \t
print('탭\t공백') # 탭  공백

# \', \", \\
print('문자열에 \'홑\'따옴표 사용') # 문자열에 '홑'따옴표 사용
print('문자열에 \"쌍\"따옴표 사용') # 문자열에 "쌍"따옴표 사용
print('문자열에 \\역슬래시\\ 사용') # 문자열에 \역슬래시\ 사용

# ===========================================================

# 예제 1
print('이름:최수지','전화번호:010-1234-5678', '주소:서울시 종로구 종로3가', sep='\n')

# 예제 2
print('\"C:\\Program Files\\Python35\\Scripts\\\"', "\"C:\\Users\\admin\\temp\\\"", sep='\n')

# 예제 3
print('\t\t#### 회비 정보 ####')
print('='*40)
print('이름\t\t나이\t\t전화번호\t\t회비')
print('='*40)
print('김동완\t38\t010-1111-1111\t\\20,000','서지수\t24\t010-1234-5678\t\\30,000','이지은\t25\t010-2525-2345\t\\50,000',sep='\n')
print('-'*40)
print('총합계\t\t\t\t\t\t\\100,000')
print('='*40)
